In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [4]:
df=sns.load_dataset("tips")
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.4 KB

In [6]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [7]:
df.isnull().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [8]:
df.duplicated().sum()

np.int64(1)

In [9]:
df.drop_duplicates(inplace=True)

In [10]:
df.duplicated().sum()

np.int64(0)

In [11]:
df.isnull().sum().sum()

np.int64(0)

In [12]:
df.shape

(243, 7)

In [13]:
df_num=df.select_dtypes(include="number")
df_cat=df.select_dtypes(include="category")

In [14]:
df_num.shape,df_cat.shape

((243, 3), (243, 4))

In [15]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [16]:
df["size"].value_counts()

size
2    155
3     38
4     37
5      5
1      4
6      4
Name: count, dtype: int64

In [17]:
df["time"].value_counts()

time
Dinner    176
Lunch      67
Name: count, dtype: int64

In [18]:
df["day"].value_counts()

day
Sat     87
Sun     76
Thur    61
Fri     19
Name: count, dtype: int64

In [19]:
df["smoker"].value_counts()

smoker
No     151
Yes     92
Name: count, dtype: int64

In [20]:
df["sex"].value_counts()

sex
Male      157
Female     86
Name: count, dtype: int64

In [21]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [22]:
df_out=df[['sex','smoker','time']]

In [23]:
from sklearn.preprocessing import LabelEncoder
df["sex"]=LabelEncoder().fit_transform(df["sex"])
df["smoker"]=LabelEncoder().fit_transform(df["smoker"])
df["time"]=LabelEncoder().fit_transform(df["time"])

In [24]:
df.head()

   total_bill   tip  sex  smoker  day  time  size
0       16.99  1.01    0       0  Sun     0     2
1       10.34  1.66    1       0  Sun     0     3
2       21.01  3.50    1       0  Sun     0     3
3       23.68  3.31    1       0  Sun     0     2
4       24.59  3.61    0       0  Sun     0     4

In [28]:
col=df.columns

In [29]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [ ]:
#need to learn one hot encoding